# AirDensity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..AirDensity Property
DuctSettings Class See Also
---
The air density in kg/ft^3.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AirDensity { get; set; }
```

Visual Basic
---
```text
Public Property AirDensity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AirDensity {
	double get ();
	void set (double value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace